module Inception.Sub.Machine where

open import Data.List
open import Data.Product

open import Inception.Sub.Syntax

data Elem {Γ : Ctx} {A B : Ty} : Set where
  cont : Γ ⊢ᶜ B → Elem
  comp : (Γ ∙ A) ⊢ᶜ B → Elem

data Stack : Set where
  nil : Stack
  _∷_ : {Γ : Ctx} {A B : Ty} -> (Elem {Γ} {A} {B}) -> Stack -> Stack


data State : Set where
  ⟪_,_,_⟫ : {Γ : Ctx} {A : Ty} -> Γ ⊢ᶜ A -> Ctx × Ctx -> Stack -> State

data _~>_ : State -> State -> Set where
  ~>-app : {M : (Γ ∙ A) ⊢ᶜ B} {V : Γ ⊢ᵛ A} {k : Stack}
         -----------------------------------------------------------------------------------------------------
         ->    ⟪ app (lam M) V                , (ε , ε)                        , k                           ⟫
            ~> ⟪ sub-comp (sub-ex sub-id V) M , (ε , ε)                        , k                           ⟫
  ~>-push : {M : Γ ⊢ᶜ A} {N : (Γ ∙ A) ⊢ᶜ B} {k : Stack}
         -----------------------------------------------------------------------------------------------------
         ->    ⟪ push M N                     , (ε , ε)                        , k                           ⟫
            ~> ⟪ M                            , (ε , ε)                        , ( comp N ) ∷ k              ⟫
  ~>-return-pop : {V : Γ ⊢ᵛ A} {Δ : Ctx} {K : Δ ⊢ᶜ D} {k : Stack}
         -----------------------------------------------------------------------------------------------------
         ->    ⟪ return V                     , (ε , ε)                        , ( cont {Δ} {C} {D} K ) ∷ k  ⟫
            ~> ⟪ return V                     , (ε , ε)                        , k                           ⟫
  ~>-return-step : {V : Γ ⊢ᵛ A} {M : (Γ ∙ A) ⊢ᶜ B} {k : Stack}
         -----------------------------------------------------------------------------------------------------
         ->    ⟪ return V                       , (ε , ε)                      , ( comp M ) ∷ k              ⟫
            ~> ⟪ (sub-comp (sub-ex sub-id V) M) , (ε , ε)                      , k                           ⟫
  ~>-sub : {M : (Γ ∙ `V) ⊢ᶜ A} {N : Γ ⊢ᶜ A} {k : Stack}
         -----------------------------------------------------------------------------------------------------
         ->    ⟪ sub M N                        , (ε , ε)                      , k                           ⟫
            ~> ⟪ M                              , (ε , ε)                      , ( cont {Γ} {`V} {A} N ) ∷ k ⟫
  ~>-var-pop : {V : Γ ⊢ᵛ `V} {K : (Γ ∙ C) ⊢ᶜ D} {k : Stack}
         -----------------------------------------------------------------------------------------------------
         ->    ⟪ var {A = A} V                  , (ε , ε)                      , (comp K) ∷ k                ⟫
            ~> ⟪ var {A = A} V                  , (ε , ε)                      , k                           ⟫
  ~>-var-lookup-init : {i : Γ ∋ `V} {N : Δ ⊢ᶜ D} {k : Stack}
         -----------------------------------------------------------------------------------------------------
         ->    ⟪ var {A = A} (var i)            , (ε , ε)                      , (cont {Δ} {`V} {D} N) ∷ k   ⟫
            ~> ⟪ var {A = A} (var i)            , (Γ , Δ)                      , (cont {Δ} {`V} {D} N) ∷ k   ⟫
  ~>-var-lookup-pop : {i : Γ ∋ `V} {N : Δ ⊢ᶜ D} {k : Stack}
         -----------------------------------------------------------------------------------------------------
         ->    ⟪ var {A = A} (var i)            , (ε , Ψ)                      , (cont {Δ} {`V} {D} N) ∷ k   ⟫
            ~> ⟪ var {A = A} (var i)            , (ε , ε)                      , k                           ⟫
  ~>-var-lookup-step : {i : Γ ∋ `V} {B' C' : Ty} {Ψ' : Ctx} {N : Δ ⊢ᶜ D} {k : Stack}
         -----------------------------------------------------------------------------------------------------
         ->    ⟪ var {A = A} (var i)            , (Ψ' ∙ B' ∙ B , Ψ ∙ C' ∙ C)   , (cont {Δ} {`V} {D} N) ∷ k   ⟫
            ~> ⟪ var {A = A} (var i)            , (Ψ' ∙ B' , Ψ ∙ C')           , k                           ⟫
  ~>-var-step : {i : Γ ∋ `V} {N : Δ ⊢ᶜ D} {k : Stack}
         -----------------------------------------------------------------------------------------------------
         ->    ⟪ var {A = A} (var i)            , (ε ∙ B , ε ∙ C)              , (cont {Δ} {`V} {D} N) ∷ k   ⟫
            ~> ⟪ N                              , (ε , ε)                      , k                           ⟫
