module Inception.Sub.simpleVM (R : Set) where

open import Function.Base using (id)
open import Data.Product using (proj₁; proj₂; _,_)

import Relation.Binary.PropositionalEquality as Eq
open Eq using (_≡_; refl; trans; cong; sym)
open Eq.≡-Reasoning

open import Inception.Sub.Syntax
open import Inception.Sub.CPS R

open import Data.Unit

variable
  A' B' C' D' X Y Z X' Y' Z' Z'' : Ty
  Γ' Γ'' Γ''' Δ' : Ctx


--infix 40 _▣
--infixr 35 _~>ᵛᵛ⟨_⟩_
infix 30 _﹐_◾
infixr 25 _﹐_∷_
-- infixr 25 _﹐_∷l⟨_⟩_
-- infixr 25 _﹐_∷r⟨_⟩_
infix 20 ∘_
infix 20 ∙_
infix 15 _⇝ᵛᵛ_
infix 15 _⇝ᵛᵛ*_


data valStack' : (Γ ⊢ᵛ A) → ⟦ Γ ⟧ˣ → Set where

    _﹐_◾ : (M : Γ ⊢ᵛ A) → (γ : ⟦ Γ ⟧ˣ) → valStack' M γ

    _﹐_∷_ : (M : Γ ⊢ᵛ X) → (γ : ⟦ Γ ⟧ˣ) → {M' : Γ' ⊢ᵛ X'} → {γ' : ⟦ Γ' ⟧ˣ} → valStack' M' γ' → valStack' M γ

--    _﹐_∷pm⟨_⟩_ : (M : Γ ⊢ᵛ A `× B) → (γ : ⟦ Γ ⟧ˣ) → {M' : Γ' ⊢ᵛ A `× B} → {γ' : ⟦ Γ' ⟧ˣ} → {N : (Γ' ∙ A ∙ B) ⊢ᵛ C} → (M≡M' : ⟦ M ⟧ᵛ γ ≡ ⟦ M' ⟧ᵛ γ') → valStack (pm M' N) γ'
--        → valStack M γ
--
--    _﹐_∷l⟨_⟩_ : (LHS : Γ ⊢ᵛ A) → (γ : ⟦ Γ ⟧ˣ) → {LHS' : Γ' ⊢ᵛ A} → {γ' : ⟦ Γ' ⟧ˣ} → (L≡L' : ⟦ LHS ⟧ᵛ γ ≡ ⟦ LHS' ⟧ᵛ γ') → {RHS : Γ' ⊢ᵛ B} → valStack (pair LHS' RHS) γ'
--        → valStack LHS γ
--
--    _﹐_∷r⟨_⟩_ : (RHS : Γ ⊢ᵛ A) → (γ : ⟦ Γ ⟧ˣ) → {RHS' : Γ' ⊢ᵛ A} → {γ' : ⟦ Γ' ⟧ˣ} → (R≡R' : ⟦ RHS ⟧ᵛ γ ≡ ⟦ RHS' ⟧ᵛ γ') → {LHS : Γ' ⊢ᵛ B} → valStack (pair LHS RHS') γ'
--        → valStack RHS γ

data VState' : Set where

     ∘_ : {M : Γ ⊢ᵛ X} → {γ : ⟦ Γ ⟧ˣ} → valStack' M γ → VState'

     ∙_ : {M : Γ ⊢ᵛ X} → {γ : ⟦ Γ ⟧ˣ} → valStack' M γ → VState'


data _⇝ᵛᵛ_ : VState' → VState' → Set where

     ∘var⇝   : {γ : ⟦ Γ ⟧ˣ} → {i : Γ ∋ X} → {tail : valStack' (var i) γ} → ∘ tail ⇝ᵛᵛ ∙ tail

     ∘lam⇝ : {γ : ⟦ Γ ⟧ˣ} → {M : (Γ ∙ X) ⊢ᶜ Y} → {tail : valStack' (lam M) γ} → ∘ tail ⇝ᵛᵛ ∙ tail

     ∘pair⇝ : {γ : ⟦ Γ ⟧ˣ} → {LHS : Γ ⊢ᵛ X} → {RHS : Γ ⊢ᵛ Y} → {tail : valStack' (pair LHS RHS) γ} → ∘ tail ⇝ᵛᵛ ∘ LHS ﹐ γ ∷ tail

     ∘pm⇝ : {γ : ⟦ Γ ⟧ˣ} → {M : Γ ⊢ᵛ X `× Y} → {N : (Γ ∙ X ∙ Y) ⊢ᵛ Z} → {tail : valStack' (pm M N) γ} → ∘ tail ⇝ᵛᵛ ∘ M ﹐ γ ∷ tail

     ∘unit⇝ : {γ : ⟦ Γ ⟧ˣ} → {tail : valStack' unit γ} → ∘ tail ⇝ᵛᵛ ∙ tail

     -- (∙ var ∷ pm ∷ tail) transitions
     ∙var∷pm◾⇝ : (γ : ⟦ Γ ⟧ˣ) → (γ' : ⟦ Γ' ⟧ˣ)
                 → (i : Γ ∋ X `× Y)
                 → (M : Γ' ⊢ᵛ X `× Y) → (N : (Γ' ∙ X ∙ Y) ⊢ᵛ Z')
                 → (≡M : ⟦ var i ⟧ᵛ γ ≡ ⟦ M ⟧ᵛ γ')
                 →    ∙ var i ﹐ γ ∷ pm M N ﹐ γ' ◾ ⇝ᵛᵛ ∘ N ﹐ ((γ' , proj₁ (⟦ var i ⟧ᵛ γ)) , proj₂ (⟦ var i ⟧ᵛ γ)) ◾

     ∙var∷pm∷pm⇝ : (γ : ⟦ Γ ⟧ˣ) → (γ' : ⟦ Γ' ⟧ˣ) → {γ'' : ⟦ Γ'' ⟧ˣ}
                 → (i : Γ ∋ X `× Y)
                 → (M : Γ' ⊢ᵛ X `× Y) → (N : (Γ' ∙ X ∙ Y) ⊢ᵛ X' `× Y')
                 → {M' : Γ'' ⊢ᵛ X' `× Y'} → {N' : (Γ'' ∙ X' ∙ Y') ⊢ᵛ Z}
                 → (≡M : ⟦ var i ⟧ᵛ γ ≡ ⟦ M ⟧ᵛ γ') → (≡M' : ⟦ (pm M N) ⟧ᵛ γ' ≡ ⟦ M' ⟧ᵛ γ'')
                 → (tail : valStack' (pm M' N') γ'')
                 →   ∙ var i ﹐ γ ∷ pm M N ﹐ γ' ∷ tail ⇝ᵛᵛ ∘ N ﹐ ((γ' ,  proj₁ (⟦ var i ⟧ᵛ γ)) ,  proj₂ (⟦ var i ⟧ᵛ γ)) ∷ tail

     ∙var∷pm∷l⇝ : (γ : ⟦ Γ ⟧ˣ) → (γ' : ⟦ Γ' ⟧ˣ) → {γ'' : ⟦ Γ'' ⟧ˣ}
                 → (i : Γ ∋ X `× Y)
                 → (M : Γ' ⊢ᵛ X `× Y) → (N : (Γ' ∙ X ∙ Y) ⊢ᵛ Z)
                 → {LHS : Γ'' ⊢ᵛ Z} → {RHS : Γ'' ⊢ᵛ Z'}
                 → (≡M : ⟦ var i ⟧ᵛ γ ≡ ⟦ M ⟧ᵛ γ') → (≡LHS : ⟦ (pm M N) ⟧ᵛ γ' ≡ ⟦ LHS ⟧ᵛ γ'')
                 → (tail : valStack' (pair LHS RHS) γ'')
                 →    ∙ var i ﹐ γ ∷ pm M N ﹐ γ' ∷ tail ⇝ᵛᵛ ∘ N ﹐ ((γ' ,  proj₁ (⟦ var i ⟧ᵛ γ)) ,  proj₂ (⟦ var i ⟧ᵛ γ)) ∷ tail

     ∙var∷pm∷r⇝ : (γ : ⟦ Γ ⟧ˣ) → (γ' : ⟦ Γ' ⟧ˣ) → {γ'' : ⟦ Γ'' ⟧ˣ}
                 → (i : Γ ∋ X `× Y)
                 → (M : Γ' ⊢ᵛ X `× Y) → (N : (Γ' ∙ X ∙ Y) ⊢ᵛ Z')
                 → {LHS : Γ'' ⊢ᵛ Z} → {RHS : Γ'' ⊢ᵛ Z'}
                 → (≡M : ⟦ var i ⟧ᵛ γ ≡ ⟦ M ⟧ᵛ γ') → (≡RHS : ⟦ (pm M N) ⟧ᵛ γ' ≡ ⟦ RHS ⟧ᵛ γ'')
                 → (tail : valStack' (pair LHS RHS) γ'')
                 →    ∙ var i ﹐ γ ∷ pm M N ﹐ γ' ∷ tail ⇝ᵛᵛ ∘ N ﹐ ((γ' , proj₁ (⟦ var i ⟧ᵛ γ)) , proj₂ (⟦ var i ⟧ᵛ γ)) ∷ tail

     -- (∙ pair ∷ pm ∷ tail) transitions
     ∙pair∷pm◾⇝ : (γ : ⟦ Γ ⟧ˣ) → (γ' : ⟦ Γ' ⟧ˣ)
                 → (x : Γ ⊢ᵛ X) → (y : Γ ⊢ᵛ Y)
                 → (M : Γ' ⊢ᵛ X `× Y) → (N : (Γ' ∙ X ∙ Y) ⊢ᵛ Z')
                 → (≡M : ⟦ pair x y ⟧ᵛ γ ≡ ⟦ M ⟧ᵛ γ')
                 →    ∙ pair x y ﹐ γ ∷ pm M N ﹐ γ' ◾ ⇝ᵛᵛ ∘ N ﹐ ((γ' ,  ⟦ x ⟧ᵛ γ) ,  ⟦ y ⟧ᵛ γ) ◾

     ∙pair∷pm∷pm⇝ : (γ : ⟦ Γ ⟧ˣ) → (γ' : ⟦ Γ' ⟧ˣ) → {γ'' : ⟦ Γ'' ⟧ˣ}
                 → (x : Γ ⊢ᵛ X) → (y : Γ ⊢ᵛ Y)
                 → (M : Γ' ⊢ᵛ X `× Y) → (N : (Γ' ∙ X ∙ Y) ⊢ᵛ X' `× Y')
                 → {M' : Γ'' ⊢ᵛ X' `× Y'} → {N' : (Γ'' ∙ X' ∙ Y') ⊢ᵛ C}
                 → (≡M : ⟦ pair x y ⟧ᵛ γ ≡ ⟦ M ⟧ᵛ γ') → (≡M' : ⟦ (pm M N) ⟧ᵛ γ' ≡ ⟦ M' ⟧ᵛ γ'')
                 → (tail : valStack' (pm M' N') γ'')
                 →   ∙ pair x y ﹐ γ ∷ pm M N ﹐ γ' ∷ tail ⇝ᵛᵛ ∘ N ﹐ ((γ' ,  ⟦ x ⟧ᵛ γ) ,  ⟦ y ⟧ᵛ γ) ∷ tail

     ∙pair∷pm∷l⇝ : (γ : ⟦ Γ ⟧ˣ) → (γ' : ⟦ Γ' ⟧ˣ) → {γ'' : ⟦ Γ'' ⟧ˣ}
                 → (x : Γ ⊢ᵛ X) → (y : Γ ⊢ᵛ Y)
                 → (M : Γ' ⊢ᵛ X `× Y) → (N : (Γ' ∙ X ∙ Y) ⊢ᵛ Z)
                 → {LHS : Γ'' ⊢ᵛ Z} → {RHS : Γ'' ⊢ᵛ Z'}
                 → (≡M : ⟦ pair x y ⟧ᵛ γ ≡ ⟦ M ⟧ᵛ γ') → (≡LHS : ⟦ (pm M N) ⟧ᵛ γ' ≡ ⟦ LHS ⟧ᵛ γ'')
                 → (tail : valStack' (pair LHS RHS) γ'')
                 →    ∙ pair x y ﹐ γ ∷ tail ⇝ᵛᵛ ∘ N ﹐ ((γ' ,  ⟦ x ⟧ᵛ γ) ,  ⟦ y ⟧ᵛ γ) ∷ tail

     ∙pair∷pm∷r⇝ : (γ : ⟦ Γ ⟧ˣ) → (γ' : ⟦ Γ' ⟧ˣ) → {γ'' : ⟦ Γ'' ⟧ˣ}
                 → (x : Γ ⊢ᵛ X) → (y : Γ ⊢ᵛ Y)
                 → (M : Γ' ⊢ᵛ X `× Y) → (N : (Γ' ∙ X ∙ Y) ⊢ᵛ Z')
                 → {LHS : Γ'' ⊢ᵛ Z} → {RHS : Γ'' ⊢ᵛ Z'}
                 → (≡M : ⟦ pair x y ⟧ᵛ γ ≡ ⟦ M ⟧ᵛ γ') → (≡RHS : ⟦ (pm M N) ⟧ᵛ γ' ≡ ⟦ RHS ⟧ᵛ γ'')
                 → (tail : valStack' (pair LHS RHS) γ'')
                 →    ∙ pair x y ﹐ γ ∷ pm M N ﹐ γ' ∷ tail ⇝ᵛᵛ ∘ N ﹐ ((γ' ,  ⟦ x ⟧ᵛ γ) ,  ⟦ y ⟧ᵛ γ) ∷ tail

     -------------------------------------------------------------------------------------

     -- (∙ T ∷ (_ ﹐ RHS) ∷ tail) transitions with T = var i
     ∙var∷l◾⇝ : (γ : ⟦ Γ ⟧ˣ) → (γ' : ⟦ Γ' ⟧ˣ)
                 → (i : Γ ∋ X)
                 → (LHS : Γ' ⊢ᵛ X) → (RHS : Γ' ⊢ᵛ Y)
                 → (≡LHS : ⟦ var i ⟧ᵛ γ ≡ ⟦ LHS ⟧ᵛ γ')
                 →   ∙ var i ﹐ γ ∷ pair LHS RHS ﹐ γ' ◾ ⇝ᵛᵛ ∘ RHS ﹐ γ' ∷ pair (var h) (wk-val (wk-wk wk-id) RHS) ﹐ (γ' ,  ⟦ var i ⟧ᵛ γ) ◾

     ∙var∷l∷pm⇝ : (γ : ⟦ Γ ⟧ˣ) → (γ' : ⟦ Γ' ⟧ˣ) → {γ'' : ⟦ Γ'' ⟧ˣ}
                 → (i : Γ ∋ X)
                 → (LHS : Γ' ⊢ᵛ X) → (RHS : Γ' ⊢ᵛ Y)
                 → {M' : Γ'' ⊢ᵛ X `× Y} → {N' : (Γ'' ∙ X ∙ Y) ⊢ᵛ Z}
                 → (≡LHS : ⟦ var i ⟧ᵛ γ ≡ ⟦ LHS ⟧ᵛ γ') → (≡M' : ⟦ pair LHS RHS ⟧ᵛ γ' ≡ ⟦ M' ⟧ᵛ γ'')
                 → (tail : valStack' (pm M' N') γ'')
                 →   ∙ var i ﹐ γ ∷ pair LHS RHS ﹐ γ' ∷ tail ⇝ᵛᵛ ∘ RHS ﹐ γ' ∷ pair (var h) (wk-val (wk-wk wk-id) RHS) ﹐ (γ' ,  ⟦ var i ⟧ᵛ γ) ∷ tail

     ∙var∷l∷l⇝ : (γ : ⟦ Γ ⟧ˣ) → (γ' : ⟦ Γ' ⟧ˣ) → {γ'' : ⟦ Γ'' ⟧ˣ}
                 → (i : Γ ∋ X)
                 → (LHS : Γ' ⊢ᵛ X) → (RHS : Γ' ⊢ᵛ Y)
                 → {LHS' : Γ'' ⊢ᵛ X `× Y} → {RHS' : Γ'' ⊢ᵛ Z}
                 → (≡LHS : ⟦ var i ⟧ᵛ γ ≡ ⟦ LHS ⟧ᵛ γ') → (≡LHS' : ⟦ pair LHS RHS ⟧ᵛ γ' ≡ ⟦ LHS' ⟧ᵛ γ'')
                 → (tail : valStack' (pair LHS' RHS') γ'')
                 →   ∙ var i ﹐ γ ∷ pair LHS RHS ﹐ γ' ∷ tail ⇝ᵛᵛ ∘ RHS ﹐ γ' ∷ pair (var h) (wk-val (wk-wk wk-id) RHS) ﹐ (γ' ,  ⟦ var i ⟧ᵛ γ) ∷ tail

     ∙var∷l∷r⇝ : (γ : ⟦ Γ ⟧ˣ) → (γ' : ⟦ Γ' ⟧ˣ) → {γ'' : ⟦ Γ'' ⟧ˣ}
                 → (i : Γ ∋ X)
                 → (LHS : Γ' ⊢ᵛ X) → (RHS : Γ' ⊢ᵛ Y)
                 → {LHS' : Γ'' ⊢ᵛ Z} → {RHS' : Γ'' ⊢ᵛ X `× Y}
                 → (≡LHS : ⟦ var i ⟧ᵛ γ ≡ ⟦ LHS ⟧ᵛ γ') → (≡RHS' : ⟦ pair LHS RHS ⟧ᵛ γ' ≡ ⟦ RHS' ⟧ᵛ γ'')
                 → (tail : valStack' (pair LHS' RHS') γ'')
                 →   ∙ var i ﹐ γ ∷ pair LHS RHS ﹐ γ' ∷ tail ⇝ᵛᵛ ∘ RHS ﹐ γ' ∷ pair (var h) (wk-val (wk-wk wk-id) RHS) ﹐ (γ' ,  ⟦ var i ⟧ᵛ γ) ∷ tail

     -- (∙ T ∷ (_ ﹐ RHS) ∷ tail) transitions with T = lam M
     ∙lam∷l◾⇝ : (γ : ⟦ Γ ⟧ˣ) → (γ' : ⟦ Γ' ⟧ˣ)
                 → (M : (Γ ∙ X) ⊢ᶜ Y)
                 → (LHS : Γ' ⊢ᵛ X `⇒ Y) → (RHS : Γ' ⊢ᵛ Z)
                 → (≡LHS : ⟦ lam M ⟧ᵛ γ ≡ ⟦ LHS ⟧ᵛ γ')
                 →   ∙ lam M ﹐ γ ∷ pair LHS RHS ﹐ γ' ◾ ⇝ᵛᵛ ∘ RHS ﹐ γ' ∷ pair (var h) (wk-val (wk-wk wk-id) RHS) ﹐ (γ' ,  ⟦ lam M ⟧ᵛ γ) ◾

     ∙lam∷l∷pm⇝ : (γ : ⟦ Γ ⟧ˣ) → (γ' : ⟦ Γ' ⟧ˣ) → {γ'' : ⟦ Γ'' ⟧ˣ}
                 → (M : (Γ ∙ X) ⊢ᶜ Y)
                 → (LHS : Γ' ⊢ᵛ X `⇒ Y) → (RHS : Γ' ⊢ᵛ Z)
                 → {M' : Γ'' ⊢ᵛ (X `⇒ Y) `× Z} → {N' : (Γ'' ∙ (X `⇒ Y) ∙ Z) ⊢ᵛ Z'}
                 → (≡LHS : ⟦ lam M ⟧ᵛ γ ≡ ⟦ LHS ⟧ᵛ γ') → (≡M' : ⟦ pair LHS RHS ⟧ᵛ γ' ≡ ⟦ M' ⟧ᵛ γ'')
                 → (tail : valStack' (pm M' N') γ'')
                 →   ∙ lam M ﹐ γ ∷ pair LHS RHS ﹐ γ' ∷ tail ⇝ᵛᵛ ∘ RHS ﹐ γ' ∷ pair (var h) (wk-val (wk-wk wk-id) RHS) ﹐ (γ' ,  ⟦ lam M ⟧ᵛ γ) ∷ tail

     ∙lam∷l∷l⇝ : (γ : ⟦ Γ ⟧ˣ) → (γ' : ⟦ Γ' ⟧ˣ) → {γ'' : ⟦ Γ'' ⟧ˣ}
                 → (M : (Γ ∙ X) ⊢ᶜ Y)
                 → (LHS : Γ' ⊢ᵛ X `⇒ Y) → (RHS : Γ' ⊢ᵛ Z)
                 → {LHS' : Γ'' ⊢ᵛ (X `⇒ Y) `× Z} → {RHS' : Γ'' ⊢ᵛ Z'}
                 → (≡LHS : ⟦ lam M ⟧ᵛ γ ≡ ⟦ LHS ⟧ᵛ γ') → (≡LHS' : ⟦ pair LHS RHS ⟧ᵛ γ' ≡ ⟦ LHS' ⟧ᵛ γ'')
                 → (tail : valStack' (pair LHS' RHS') γ'')
                 →   ∙ lam M ﹐ γ ∷ pair LHS RHS ﹐ γ' ∷ tail ⇝ᵛᵛ ∘ RHS ﹐ γ' ∷ pair (var h) (wk-val (wk-wk wk-id) RHS) ﹐ (γ' ,  ⟦ lam M ⟧ᵛ γ) ∷ tail

     ∙lam∷l∷r⇝ : (γ : ⟦ Γ ⟧ˣ) → (γ' : ⟦ Γ' ⟧ˣ) → {γ'' : ⟦ Γ'' ⟧ˣ}
                 → (M : (Γ ∙ X) ⊢ᶜ Y)
                 → (LHS : Γ' ⊢ᵛ X `⇒ Y) → (RHS : Γ' ⊢ᵛ Z)
                 → {LHS' : Γ'' ⊢ᵛ Z'} → {RHS' : Γ'' ⊢ᵛ (X `⇒ Y) `× Z}
                 → (≡LHS : ⟦ lam M ⟧ᵛ γ ≡ ⟦ LHS ⟧ᵛ γ') → (≡RHS' : ⟦ pair LHS RHS ⟧ᵛ γ' ≡ ⟦ RHS' ⟧ᵛ γ'')
                 → (tail : valStack' (pair LHS' RHS') γ'')
                 →   ∙ lam M ﹐ γ ∷ pair LHS RHS ﹐ γ' ∷ tail ⇝ᵛᵛ ∘ RHS ﹐ γ' ∷ pair (var h) (wk-val (wk-wk wk-id) RHS) ﹐ (γ' ,  ⟦ lam M ⟧ᵛ γ) ∷ tail

     -- (∙ T ∷ (_ ﹐ RHS) ∷ tail) transitions with T = unit
     ∙unit∷l◾⇝ : (γ : ⟦ Γ ⟧ˣ) → (γ' : ⟦ Γ' ⟧ˣ)
                 → (LHS : Γ' ⊢ᵛ `Unit) → (RHS : Γ' ⊢ᵛ Y)
                 → (≡LHS : ⟦ unit ⟧ᵛ γ ≡ ⟦ LHS ⟧ᵛ γ')
                 →   ∙ unit ﹐ γ ∷ pair LHS RHS ﹐ γ' ◾ ⇝ᵛᵛ ∘ RHS ﹐ γ' ∷ pair (var h) (wk-val (wk-wk wk-id) RHS) ﹐ (γ' ,  ⟦ unit ⟧ᵛ γ) ◾

     ∙unit∷l∷pm⇝ : (γ : ⟦ Γ ⟧ˣ) → (γ' : ⟦ Γ' ⟧ˣ) → {γ'' : ⟦ Γ'' ⟧ˣ}
                 → (LHS : Γ' ⊢ᵛ `Unit) → (RHS : Γ' ⊢ᵛ Y)
                 → {M' : Γ'' ⊢ᵛ `Unit `× Y} → {N' : (Γ'' ∙ `Unit ∙ Y) ⊢ᵛ Z}
                 → (≡LHS : ⟦ unit ⟧ᵛ γ ≡ ⟦ LHS ⟧ᵛ γ') → (≡M' : ⟦ pair LHS RHS ⟧ᵛ γ' ≡ ⟦ M' ⟧ᵛ γ'')
                 → (tail : valStack' (pm M' N') γ'')
                 →   ∙ unit ﹐ γ ∷ pair LHS RHS ﹐ γ' ∷ tail ⇝ᵛᵛ ∘ RHS ﹐ γ' ∷ pair (var h) (wk-val (wk-wk wk-id) RHS) ﹐ (γ' ,  ⟦ unit ⟧ᵛ γ) ∷ tail

     ∙unit∷l∷l⇝ : (γ : ⟦ Γ ⟧ˣ) → (γ' : ⟦ Γ' ⟧ˣ) → {γ'' : ⟦ Γ'' ⟧ˣ}
                 → (LHS : Γ' ⊢ᵛ `Unit) → (RHS : Γ' ⊢ᵛ Y)
                 → {LHS' : Γ'' ⊢ᵛ `Unit `× Y} → {RHS' : Γ'' ⊢ᵛ Z}
                 → (≡LHS : ⟦ unit ⟧ᵛ γ ≡ ⟦ LHS ⟧ᵛ γ') → (≡LHS' : ⟦ pair LHS RHS ⟧ᵛ γ' ≡ ⟦ LHS' ⟧ᵛ γ'')
                 → (tail : valStack' (pair LHS' RHS') γ'')
                 →   ∙ unit ﹐ γ ∷ pair LHS RHS ﹐ γ' ∷ tail ⇝ᵛᵛ ∘ RHS ﹐ γ' ∷ pair (var h) (wk-val (wk-wk wk-id) RHS) ﹐ (γ' ,  ⟦ unit ⟧ᵛ γ) ∷ tail

     ∙unit∷l∷r⇝ : (γ : ⟦ Γ ⟧ˣ) → (γ' : ⟦ Γ' ⟧ˣ) → {γ'' : ⟦ Γ'' ⟧ˣ}
                 → (LHS : Γ' ⊢ᵛ `Unit) → (RHS : Γ' ⊢ᵛ Y)
                 → {LHS' : Γ'' ⊢ᵛ Z} → {RHS' : Γ'' ⊢ᵛ `Unit `× Y}
                 → (≡LHS : ⟦ unit ⟧ᵛ γ ≡ ⟦ LHS ⟧ᵛ γ') → (≡RHS' : ⟦ pair LHS RHS ⟧ᵛ γ' ≡ ⟦ RHS' ⟧ᵛ γ'')
                 → (tail : valStack' (pair LHS' RHS') γ'')
                 →   ∙ unit ﹐ γ ∷ pair LHS RHS ﹐ γ' ∷ tail ⇝ᵛᵛ ∘ RHS ﹐ γ' ∷ pair (var h) (wk-val (wk-wk wk-id) RHS) ﹐ (γ' ,  ⟦ unit ⟧ᵛ γ) ∷ tail

     -- (∙ T ∷ (_ ﹐ RHS) ∷ tail) transitions with T = pair x y
     ∙pair∷l◾⇝ : (γ : ⟦ Γ ⟧ˣ) → (γ' : ⟦ Γ' ⟧ˣ)
                 → (x : Γ ⊢ᵛ X) → (y : Γ ⊢ᵛ Y)
                 → (LHS : Γ' ⊢ᵛ X `× Y) → (RHS : Γ' ⊢ᵛ Z)
                 → (≡LHS : ⟦ pair x y ⟧ᵛ γ ≡ ⟦ LHS ⟧ᵛ γ')
                 →   ∙ pair x y ﹐ γ ∷ pair LHS RHS ﹐ γ' ◾ ⇝ᵛᵛ ∘ RHS ﹐ γ' ∷ pair (var h) (wk-val (wk-wk wk-id) RHS) ﹐ (γ' ,  ⟦ pair x y ⟧ᵛ γ) ◾

     ∙pair∷l∷pm⇝ : (γ : ⟦ Γ ⟧ˣ) → (γ' : ⟦ Γ' ⟧ˣ) → {γ'' : ⟦ Γ'' ⟧ˣ}
                 → (x : Γ ⊢ᵛ X) → (y : Γ ⊢ᵛ Y)
                 → (LHS : Γ' ⊢ᵛ X `× Y) → (RHS : Γ' ⊢ᵛ Z)
                 → {M' : Γ'' ⊢ᵛ (X `× Y) `× Z} → {N' : (Γ'' ∙ (X `× Y) ∙ Z) ⊢ᵛ Z'}
                 → (≡LHS : ⟦ pair x y ⟧ᵛ γ ≡ ⟦ LHS ⟧ᵛ γ') → (≡M' : ⟦ pair LHS RHS ⟧ᵛ γ' ≡ ⟦ M' ⟧ᵛ γ'')
                 → (tail : valStack' (pm M' N') γ'')
                 →   ∙ pair x y ﹐ γ ∷ pair LHS RHS ﹐ γ' ∷ tail ⇝ᵛᵛ ∘ RHS ﹐ γ' ∷ pair (var h) (wk-val (wk-wk wk-id) RHS) ﹐ (γ' ,  ⟦ pair x y ⟧ᵛ γ) ∷ tail

     ∙pair∷l∷l⇝ : (γ : ⟦ Γ ⟧ˣ) → (γ' : ⟦ Γ' ⟧ˣ) → {γ'' : ⟦ Γ'' ⟧ˣ}
                 → (x : Γ ⊢ᵛ X) → (y : Γ ⊢ᵛ Y)
                 → (LHS : Γ' ⊢ᵛ X `× Y) → (RHS : Γ' ⊢ᵛ Z)
                 → {LHS' : Γ'' ⊢ᵛ (X `× Y) `× Z} → {RHS' : Γ'' ⊢ᵛ Z'}
                 → (≡LHS : ⟦ pair x y ⟧ᵛ γ ≡ ⟦ LHS ⟧ᵛ γ') → (≡LHS' : ⟦ pair LHS RHS ⟧ᵛ γ' ≡ ⟦ LHS' ⟧ᵛ γ'')
                 → (tail : valStack' (pair LHS' RHS') γ'')
                 →   ∙ pair x y ﹐ γ ∷ pair LHS RHS ﹐ γ' ∷ tail
                      ⇝ᵛᵛ
                     ∘ RHS ﹐ γ' ∷ pair (var h) (wk-val (wk-wk wk-id) RHS) ﹐ (γ' ,  ⟦ pair x y ⟧ᵛ γ) ∷ tail

     ∙pair∷l∷r⇝ : (γ : ⟦ Γ ⟧ˣ) → (γ' : ⟦ Γ' ⟧ˣ) → {γ'' : ⟦ Γ'' ⟧ˣ}
                 → (x : Γ ⊢ᵛ X) → (y : Γ ⊢ᵛ Y)
                 → (LHS : Γ' ⊢ᵛ X `× Y) → (RHS : Γ' ⊢ᵛ Z)
                 → {LHS' : Γ'' ⊢ᵛ Z'} → {RHS' : Γ'' ⊢ᵛ (X `× Y) `× Z}
                 → (≡LHS : ⟦ pair x y ⟧ᵛ γ ≡ ⟦ LHS ⟧ᵛ γ') → (≡RHS' : ⟦ pair LHS RHS ⟧ᵛ γ' ≡ ⟦ RHS' ⟧ᵛ γ'')
                 → (tail : valStack' (pair LHS' RHS') γ'')
                 →   ∙ pair x y ﹐ γ ∷ pair LHS RHS ﹐ γ' ∷ tail
                      ⇝ᵛᵛ
                     ∘ RHS ﹐ γ' ∷ pair (var h) (wk-val (wk-wk wk-id) RHS) ﹐ (γ' ,  ⟦ pair x y ⟧ᵛ γ) ∷ tail

     --------------------------------------------------------------------------------------
     -- (∙ T ∷ (LHS ﹐ _) ∷ tail) transitions with T = var i
     ∙var∷r◼⇝ : (γ : ⟦ Γ ⟧ˣ) → (γ' : ⟦ Γ' ⟧ˣ)
                 → (i : Γ ∋ Y)
                 → (LHS : Γ' ⊢ᵛ X) → (RHS : Γ' ⊢ᵛ Y)
                 → (≡RHS : ⟦ var i ⟧ᵛ γ ≡ ⟦ RHS ⟧ᵛ γ')
                 →   ∙ var i ﹐ γ ∷ pair LHS RHS ﹐ γ' ◾
                      ⇝ᵛᵛ
                     ∙ pair (wk-val (wk-wk wk-id) LHS) (var h) ﹐ (γ' , ⟦ var i ⟧ᵛ γ) ◾

     ∙var∷r∷pm⇝ : (γ : ⟦ Γ ⟧ˣ) → (γ' : ⟦ Γ' ⟧ˣ) → {γ'' : ⟦ Γ'' ⟧ˣ}
                 → (i : Γ ∋ Y)
                 → (LHS : Γ' ⊢ᵛ X) → (RHS : Γ' ⊢ᵛ Y)
                 → {M' : Γ'' ⊢ᵛ X `× Y} → {N' : (Γ'' ∙ X ∙ Y) ⊢ᵛ Z}
                 → (≡RHS : ⟦ var i ⟧ᵛ γ ≡ ⟦ RHS ⟧ᵛ γ') → (≡M' : ⟦ pair LHS RHS ⟧ᵛ γ' ≡ ⟦ M' ⟧ᵛ γ'')
                 → (tail : valStack' (pm M' N') γ'')
                 →   ∙ var i ﹐ γ ∷ pair LHS RHS ﹐ γ' ∷ tail
                      ⇝ᵛᵛ
                     ∙ pair (wk-val (wk-wk wk-id) LHS) (var h) ﹐ (γ' , ⟦ var i ⟧ᵛ γ) ∷ tail

     ∙var∷r∷l⇝ : (γ : ⟦ Γ ⟧ˣ) → (γ' : ⟦ Γ' ⟧ˣ) → {γ'' : ⟦ Γ'' ⟧ˣ}
                 → (i : Γ ∋ Y)
                 → (LHS : Γ' ⊢ᵛ X) → (RHS : Γ' ⊢ᵛ Y)
                 → {LHS' : Γ'' ⊢ᵛ X `× Y} → {RHS' : Γ'' ⊢ᵛ Z}
                 → (≡RHS : ⟦ var i ⟧ᵛ γ ≡ ⟦ RHS ⟧ᵛ γ') → (≡LHS' : ⟦ pair LHS RHS ⟧ᵛ γ' ≡ ⟦ LHS' ⟧ᵛ γ'')
                 → (tail : valStack' (pair LHS' RHS') γ'')
                 →   ∙ var i ﹐ γ ∷ pair LHS RHS ﹐ γ' ∷ tail
                      ⇝ᵛᵛ
                     ∙ pair (wk-val (wk-wk wk-id) LHS) (var h) ﹐ (γ' , ⟦ var i ⟧ᵛ γ) ∷ tail

     ∙var∷r∷r⇝ : (γ : ⟦ Γ ⟧ˣ) → (γ' : ⟦ Γ' ⟧ˣ) → {γ'' : ⟦ Γ'' ⟧ˣ}
                 → (i : Γ ∋ Y)
                 → (LHS : Γ' ⊢ᵛ X) → (RHS : Γ' ⊢ᵛ Y)
                 → {LHS' : Γ'' ⊢ᵛ Z} → {RHS' : Γ'' ⊢ᵛ X `× Y}
                 → (≡RHS : ⟦ var i ⟧ᵛ γ ≡ ⟦ RHS ⟧ᵛ γ') → (≡RHS' : ⟦ pair LHS RHS ⟧ᵛ γ' ≡ ⟦ RHS' ⟧ᵛ γ'')
                 → (tail : valStack' (pair LHS' RHS') γ'')
                 →   ∙ var i ﹐ γ ∷ pair LHS RHS ﹐ γ' ∷ tail
                      ⇝ᵛᵛ
                     ∙ pair (wk-val (wk-wk wk-id) LHS) (var h) ﹐ (γ' , ⟦ var i ⟧ᵛ γ) ∷ tail

     -- (∙ T ∷ (LHS ﹐ _) ∷ tail) transitions with T = lam M
     ∙lam∷r◾⇝ : (γ : ⟦ Γ ⟧ˣ) → (γ' : ⟦ Γ' ⟧ˣ)
                 → (M : (Γ ∙ X) ⊢ᶜ Y)
                 → (LHS : Γ' ⊢ᵛ Z) → (RHS : Γ' ⊢ᵛ X `⇒ Y)
                 → (≡RHS : ⟦ lam M ⟧ᵛ γ ≡ ⟦ RHS ⟧ᵛ γ')
                 →   ∙ lam M ﹐ γ ∷ pair LHS RHS ﹐ γ' ◾
                      ⇝ᵛᵛ
                     ∙ pair (wk-val (wk-wk wk-id) LHS) (var h) ﹐ (γ' , ⟦ lam M ⟧ᵛ γ) ◾

     ∙lam∷r∷pm⇝ : (γ : ⟦ Γ ⟧ˣ) → (γ' : ⟦ Γ' ⟧ˣ) → {γ'' : ⟦ Γ'' ⟧ˣ}
                 → (M : (Γ ∙ X) ⊢ᶜ Y)
                 → (LHS : Γ' ⊢ᵛ Z) → (RHS : Γ' ⊢ᵛ X `⇒ Y)
                 → {M' : Γ'' ⊢ᵛ Z `× (X `⇒ Y)} → {N' : (Γ'' ∙ Z ∙ (X `⇒ Y)) ⊢ᵛ Z'}
                 → (≡RHS : ⟦ lam M ⟧ᵛ γ ≡ ⟦ RHS ⟧ᵛ γ') → (≡M' : ⟦ pair LHS RHS ⟧ᵛ γ' ≡ ⟦ M' ⟧ᵛ γ'')
                 → (tail : valStack' (pm M' N') γ'')
                 →   ∙ lam M ﹐ γ ∷ pair LHS RHS ﹐ γ' ∷ tail
                      ⇝ᵛᵛ
                     ∙ pair (wk-val (wk-wk wk-id) LHS) (var h) ﹐ (γ' , ⟦ lam M ⟧ᵛ γ) ∷ tail

     ∙lam∷r∷l⇝ : (γ : ⟦ Γ ⟧ˣ) → (γ' : ⟦ Γ' ⟧ˣ) → {γ'' : ⟦ Γ'' ⟧ˣ}
                 → (M : (Γ ∙ X) ⊢ᶜ Y)
                 → (LHS : Γ' ⊢ᵛ Z) → (RHS : Γ' ⊢ᵛ X `⇒ Y)
                 → {LHS' : Γ'' ⊢ᵛ Z `× (X `⇒ Y)} → {RHS' : Γ'' ⊢ᵛ Z'}
                 → (≡RHS : ⟦ lam M ⟧ᵛ γ ≡ ⟦ RHS ⟧ᵛ γ') → (≡LHS' : ⟦ pair LHS RHS ⟧ᵛ γ' ≡ ⟦ LHS' ⟧ᵛ γ'')
                 → (tail : valStack' (pair LHS' RHS') γ'')
                 →   ∙ lam M ﹐ γ ∷ pair LHS RHS ﹐ γ' ∷ tail
                      ⇝ᵛᵛ
                     ∙ pair (wk-val (wk-wk wk-id) LHS) (var h) ﹐ (γ' , ⟦ lam M ⟧ᵛ γ) ∷ tail

     ∙lam∷r∷r⇝ : (γ : ⟦ Γ ⟧ˣ) → (γ' : ⟦ Γ' ⟧ˣ) → {γ'' : ⟦ Γ'' ⟧ˣ}
                 → (M : (Γ ∙ X) ⊢ᶜ Y)
                 → (LHS : Γ' ⊢ᵛ Z) → (RHS : Γ' ⊢ᵛ X `⇒ Y)
                 → {LHS' : Γ'' ⊢ᵛ Z'} → {RHS' : Γ'' ⊢ᵛ Z `× (X `⇒ Y)}
                 → (≡RHS : ⟦ lam M ⟧ᵛ γ ≡ ⟦ RHS ⟧ᵛ γ') → (≡RHS' : ⟦ pair LHS RHS ⟧ᵛ γ' ≡ ⟦ RHS' ⟧ᵛ γ'')
                 → (tail : valStack' (pair LHS' RHS') γ'')
                 →   ∙ lam M ﹐ γ ∷ pair LHS RHS ﹐ γ' ∷ tail
                      ⇝ᵛᵛ
                     ∙ pair (wk-val (wk-wk wk-id) LHS) (var h) ﹐ (γ' , ⟦ lam M ⟧ᵛ γ) ∷ tail

     -- (∙ T ∷ (LHS ﹐ _) ∷ tail) transitions with T = unit
     ∙unit∷r◾⇝ : (γ : ⟦ Γ ⟧ˣ) → (γ' : ⟦ Γ' ⟧ˣ)
                 → (LHS : Γ' ⊢ᵛ X) → (RHS : Γ' ⊢ᵛ `Unit)
                 → (≡RHS : ⟦ unit ⟧ᵛ γ ≡ ⟦ RHS ⟧ᵛ γ')
                 →   ∙ unit ﹐ γ ∷ pair LHS RHS ﹐ γ' ◾
                      ⇝ᵛᵛ
                     ∙ pair (wk-val (wk-wk wk-id) LHS) (var h) ﹐ (γ' , ⟦ unit ⟧ᵛ γ) ◾

     ∙unit∷r∷pm⇝ : (γ : ⟦ Γ ⟧ˣ) → (γ' : ⟦ Γ' ⟧ˣ) → {γ'' : ⟦ Γ'' ⟧ˣ}
                 → (LHS : Γ' ⊢ᵛ X) → (RHS : Γ' ⊢ᵛ `Unit)
                 → {M' : Γ'' ⊢ᵛ X `× `Unit} → {N' : (Γ'' ∙ X ∙ `Unit) ⊢ᵛ Z}
                 → (≡RHS : ⟦ unit ⟧ᵛ γ ≡ ⟦ RHS ⟧ᵛ γ') → (≡M' : ⟦ pair LHS RHS ⟧ᵛ γ' ≡ ⟦ M' ⟧ᵛ γ'')
                 → (tail : valStack' (pm M' N') γ'')
                 →   ∙ unit ﹐ γ ∷ pair LHS RHS ﹐ γ' ∷ tail
                      ⇝ᵛᵛ
                     ∙ pair (wk-val (wk-wk wk-id) LHS) (var h) ﹐ (γ' , ⟦ unit ⟧ᵛ γ) ∷ tail

     ∙unit∷r∷l⇝ : (γ : ⟦ Γ ⟧ˣ) → (γ' : ⟦ Γ' ⟧ˣ) → {γ'' : ⟦ Γ'' ⟧ˣ}
                 → (LHS : Γ' ⊢ᵛ X) → (RHS : Γ' ⊢ᵛ `Unit)
                 → {LHS' : Γ'' ⊢ᵛ X `× `Unit} → {RHS' : Γ'' ⊢ᵛ Z}
                 → (≡RHS : ⟦ unit ⟧ᵛ γ ≡ ⟦ RHS ⟧ᵛ γ') → (≡LHS' : ⟦ pair LHS RHS ⟧ᵛ γ' ≡ ⟦ LHS' ⟧ᵛ γ'')
                 → (tail : valStack' (pair LHS' RHS') γ'')
                 →   ∙ unit ﹐ γ ∷ pair LHS RHS ﹐ γ' ∷ tail
                      ⇝ᵛᵛ
                     ∙ pair (wk-val (wk-wk wk-id) LHS) (var h) ﹐ (γ' , ⟦ unit ⟧ᵛ γ) ∷ tail

     ∙unit∷r∷r⇝ : (γ : ⟦ Γ ⟧ˣ) → (γ' : ⟦ Γ' ⟧ˣ) → {γ'' : ⟦ Γ'' ⟧ˣ}
                 → (LHS : Γ' ⊢ᵛ X) → (RHS : Γ' ⊢ᵛ `Unit)
                 → {LHS' : Γ'' ⊢ᵛ Z} → {RHS' : Γ'' ⊢ᵛ X `× `Unit}
                 → (≡RHS : ⟦ unit ⟧ᵛ γ ≡ ⟦ RHS ⟧ᵛ γ') → (≡RHS' : ⟦ pair LHS RHS ⟧ᵛ γ' ≡ ⟦ RHS' ⟧ᵛ γ'')
                 → (tail : valStack' (pair LHS' RHS') γ'')
                 →   ∙ unit ﹐ γ ∷ pair LHS RHS ﹐ γ' ∷ tail
                      ⇝ᵛᵛ
                     ∙ pair (wk-val (wk-wk wk-id) LHS) (var h) ﹐ (γ' , ⟦ unit ⟧ᵛ γ) ∷ tail

     -- (∙ T ∷ (LHS ﹐ _) ∷ tail) transitions with T = pair x y
     ∙pair∷r◾⇝ : (γ : ⟦ Γ ⟧ˣ) → (γ' : ⟦ Γ' ⟧ˣ)
                 → (x : Γ ⊢ᵛ X) → (y : Γ ⊢ᵛ Y)
                 → (LHS : Γ' ⊢ᵛ Z) → (RHS : Γ' ⊢ᵛ X `× Y)
                 → (≡RHS : ⟦ pair x y ⟧ᵛ γ ≡ ⟦ RHS ⟧ᵛ γ')
                 →   ∙ pair x y ﹐ γ ∷ pair LHS RHS ﹐ γ' ◾
                      ⇝ᵛᵛ
                     ∙ pair (wk-val (wk-wk wk-id) LHS) (var h) ﹐ (γ' , ⟦ pair x y ⟧ᵛ γ) ◾

     ∙pair∷r∷pm⇝ : (γ : ⟦ Γ ⟧ˣ) → (γ' : ⟦ Γ' ⟧ˣ) → {γ'' : ⟦ Γ'' ⟧ˣ}
                 → (x : Γ ⊢ᵛ X) → (y : Γ ⊢ᵛ Y)
                 → (LHS : Γ' ⊢ᵛ Z) → (RHS : Γ' ⊢ᵛ X `× Y)
                 → {M' : Γ'' ⊢ᵛ Z `× (X `× Y)} → {N' : (Γ'' ∙ Z ∙ (X `× Y)) ⊢ᵛ Z'}
                 → (≡RHS : ⟦ pair x y ⟧ᵛ γ ≡ ⟦ RHS ⟧ᵛ γ') → (≡M' : ⟦ pair LHS RHS ⟧ᵛ γ' ≡ ⟦ M' ⟧ᵛ γ'')
                 → (tail : valStack' (pm M' N') γ'')
                 →   ∙ pair x y ﹐ γ ∷ pair LHS RHS ﹐ γ' ∷ tail
                      ⇝ᵛᵛ
                     ∙ pair (wk-val (wk-wk wk-id) LHS) (var h) ﹐ (γ' , ⟦ pair x y ⟧ᵛ γ) ∷ tail

     ∙pair∷r∷l⇝ : (γ : ⟦ Γ ⟧ˣ) → (γ' : ⟦ Γ' ⟧ˣ) → {γ'' : ⟦ Γ'' ⟧ˣ}
                 → (x : Γ ⊢ᵛ X) → (y : Γ ⊢ᵛ Y)
                 → (LHS : Γ' ⊢ᵛ Z) → (RHS : Γ' ⊢ᵛ X `× Y)
                 → {LHS' : Γ'' ⊢ᵛ Z `× (X `× Y)} → {RHS' : Γ'' ⊢ᵛ Z'}
                 → (≡RHS : ⟦ pair x y ⟧ᵛ γ ≡ ⟦ RHS ⟧ᵛ γ') → (≡LHS' : ⟦ pair LHS RHS ⟧ᵛ γ' ≡ ⟦ LHS' ⟧ᵛ γ'')
                 → (tail : valStack' (pair LHS' RHS') γ'')
                 →   ∙ pair x y ﹐ γ ∷ pair LHS RHS ﹐ γ' ∷ tail
                      ⇝ᵛᵛ
                     ∙ pair (wk-val (wk-wk wk-id) LHS) (var h) ﹐ (γ' , ⟦ pair x y ⟧ᵛ γ) ∷ tail

     ∙pair∷r∷r⇝ : (γ : ⟦ Γ ⟧ˣ) → (γ' : ⟦ Γ' ⟧ˣ) → {γ'' : ⟦ Γ'' ⟧ˣ}
                 → (x : Γ ⊢ᵛ X) → (y : Γ ⊢ᵛ Y)
                 → (LHS : Γ' ⊢ᵛ Z) → (RHS : Γ' ⊢ᵛ X `× Y)
                 → {LHS' : Γ'' ⊢ᵛ Z'} → {RHS' : Γ'' ⊢ᵛ Z `× (X `× Y)}
                 → (≡RHS : ⟦ pair x y ⟧ᵛ γ ≡ ⟦ RHS ⟧ᵛ γ') → (≡RHS' : ⟦ pair LHS RHS ⟧ᵛ γ' ≡ ⟦ RHS' ⟧ᵛ γ'')
                 → (tail : valStack' (pair LHS' RHS') γ'')
                 →   ∙ pair x y ﹐ γ ∷ pair LHS RHS ﹐ γ' ∷ tail
                      ⇝ᵛᵛ
                     ∙ pair (wk-val (wk-wk wk-id) LHS) (var h) ﹐ (γ' , ⟦ pair x y ⟧ᵛ γ) ∷ tail


data _⇝ᵛᵛ*_ : VState' → VState' → Set where

  _◽ : (VS : VState') → VS ⇝ᵛᵛ* VS

  _⇝ᵛᵛ⟨_⟩_ : (VS : VState') {VS' VS'' : VState'} → VS ⇝ᵛᵛ VS' → VS' ⇝ᵛᵛ* VS'' → VS ⇝ᵛᵛ* VS''


⇝ᵛᵛ*-trans : {S S' S'' : VState'} → S ⇝ᵛᵛ* S' → S' ⇝ᵛᵛ* S'' → S ⇝ᵛᵛ* S''
⇝ᵛᵛ*-trans (S⇝S ◽) S⇝S'' = S⇝S''
⇝ᵛᵛ*-trans (S ⇝ᵛᵛ⟨ x ⟩ T⇝S') S'⇝S'' =  S ⇝ᵛᵛ⟨ x ⟩ (⇝ᵛᵛ*-trans T⇝S' S'⇝S'')


--     ∘var⇝   : {γ : ⟦ Γ ⟧ˣ} → {i : Γ ∋ X} → {tail : valStack' (var i) γ} → ∘ tail ⇝ᵛᵛ ∙ tail
--
--     ∘lam⇝ : {γ : ⟦ Γ ⟧ˣ} → {M : (Γ ∙ X) ⊢ᶜ Y} → {tail : valStack' (lam M) γ} → ∘ tail ⇝ᵛᵛ ∙ tail
--
--     ∘pair⇝ : {γ : ⟦ Γ ⟧ˣ} → {LHS : Γ ⊢ᵛ X} → {RHS : Γ ⊢ᵛ Y} → {tail : valStack' (pair LHS RHS) γ} → ∘ tail ⇝ᵛᵛ ∘ LHS ﹐ γ ∷ tail
--
--     ∘pm⇝ : {γ : ⟦ Γ ⟧ˣ} → {M : Γ ⊢ᵛ X `× Y} → {N : (Γ ∙ X ∙ Y) ⊢ᵛ Z} → {tail : valStack' (pm M N) γ} → ∘ tail ⇝ᵛᵛ ∘ M ﹐ γ ∷ tail
--
--     ∘unit⇝ : {γ : ⟦ Γ ⟧ˣ} → {tail : valStack' unit γ} → ∘ tail ⇝ᵛᵛ ∙ tail
--
--     -- (∙ var ∷ pm ∷ tail) transitions
--     ∙var∷pm◾⇝ : (γ : ⟦ Γ ⟧ˣ) → (γ' : ⟦ Γ' ⟧ˣ)
--                 → (i : Γ ∋ X `× Y)
--                 → (M : Γ' ⊢ᵛ X `× Y) → (N : (Γ' ∙ X ∙ Y) ⊢ᵛ Z')
--                 → (≡M : ⟦ var i ⟧ᵛ γ ≡ ⟦ M ⟧ᵛ γ')
--                 →    ∙ var i ﹐ γ ∷ pm M N ﹐ γ' ◾ ⇝ᵛᵛ ∘ N ﹐ ((γ' , proj₁ (⟦ var i ⟧ᵛ γ)) , proj₂ (⟦ var i ⟧ᵛ γ)) ◾

{-
∙var∷pm◾-cong : (γ : ⟦ Γ ⟧ˣ) → (γ' : ⟦ Γ' ⟧ˣ)
            → (i : Γ ∋ X `× Y)
            → (M : Γ' ⊢ᵛ X `× Y) → (N : (Γ' ∙ X ∙ Y) ⊢ᵛ Z')
            → (≡M : ⟦ var i ⟧ᵛ γ ≡ ⟦ M ⟧ᵛ γ')
            → {result : Δ ⊢ᵛ A} → {δ : ⟦ Δ ⟧ˣ}
            → {P : Δ' ⊢ᵛ A} → {δ' : ⟦ Δ' ⟧ˣ} → (bottom : valStack' P δ')
            →    ∙ var i ﹐ γ ∷ pm M N ﹐ γ' ◾ ⇝ᵛᵛ* ∙ result ﹐ δ ◾
            →    ∙ var i ﹐ γ ∷ pm M N ﹐ γ' ∷ bottom ⇝ᵛᵛ* ∙ result ﹐ δ ∷ bottom

∙var∷pm◾-cong γ γ' i M N ≡M {result = result} {δ = δ} {P = var i₁} {δ' = δ'} bottom (.(∙ var i ﹐ γ ∷ pm M N ﹐ γ' ◾) ⇝ᵛᵛ⟨ ∙var∷pm◾⇝ .γ .γ' .i .M .N ≡M₁ ⟩ S>T) = (∙ var i ﹐ γ ∷ pm M N ﹐ γ' ∷ bottom) ⇝ᵛᵛ⟨ {!!} ⟩ {!!}
∙var∷pm◾-cong γ γ' i M N ≡M {result = result} {δ = δ} {P = lam x} {δ' = δ'} bottom (.(∙ var i ﹐ γ ∷ pm M N ﹐ γ' ◾) ⇝ᵛᵛ⟨ ∙var∷pm◾⇝ .γ .γ' .i .M .N ≡M₁ ⟩ S>T) = {!!}
∙var∷pm◾-cong γ γ' i M N ≡M {result = result} {δ = δ} {P = pair P P₁} {δ' = δ'} bottom (.(∙ var i ﹐ γ ∷ pm M N ﹐ γ' ◾) ⇝ᵛᵛ⟨ ∙var∷pm◾⇝ .γ .γ' .i .M .N ≡M₁ ⟩ S>T) = {!!}
∙var∷pm◾-cong γ γ' i M N ≡M {result = result} {δ = δ} {P = pm P P₁} {δ' = δ'} bottom (.(∙ var i ﹐ γ ∷ pm M N ﹐ γ' ◾) ⇝ᵛᵛ⟨ ∙var∷pm◾⇝ .γ .γ' .i .M .N ≡M₁ ⟩ S>T) = {!!}
∙var∷pm◾-cong γ γ' i M N ≡M {result = result} {δ = δ} {P = unit} {δ' = δ'} bottom (.(∙ var i ﹐ γ ∷ pm M N ﹐ γ' ◾) ⇝ᵛᵛ⟨ ∙var∷pm◾⇝ .γ .γ' .i .M .N ≡M₁ ⟩ S>T) = {!!}
-}


--(∙ var i ﹐ γ ∷ pm M N ﹐ γ' ∷ bottom) ⇝ᵛᵛ⟨ {!!} ⟩ {!!}
